Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rescaling (Rescaling)        (None, 448, 448, 3)       0         
_________________________________________________________________
dense (Dense)                (None, 448, 448, 128)     512       
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 516       
=================================================================
Total params: 1,028
Trainable params: 1,028
Non-trainable params: 0
_________________________________________________________________
