Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 448, 448, 3)]     0
_________________________________________________________________
rescaling (Rescaling)        (None, 448, 448, 3)       0
_________________________________________________________________
conv2d (Conv2D)              (None, 223, 223, 32)      896
_________________________________________________________________
re_lu (ReLU)                 (None, 223, 223, 32)      0
_________________________________________________________________
batch_normalization (BatchNo (None, 223, 223, 32)      128
_________________________________________________________________
dropout (Dropout)            (None, 223, 223, 32)      0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 223, 223, 192)     6336
_________________________________________________________________
re_lu_1 (ReLU)               (None, 223, 223, 192)     0
_________________________________________________________________
depthwise_conv2d (DepthwiseC (None, 111, 111, 192)     1920
_________________________________________________________________
re_lu_2 (ReLU)               (None, 111, 111, 192)     0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 111, 111, 48)      9264
_________________________________________________________________
batch_normalization_1 (Batch (None, 111, 111, 48)      192
_________________________________________________________________
dropout_1 (Dropout)          (None, 111, 111, 48)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 111, 111, 240)     11760
_________________________________________________________________
re_lu_3 (ReLU)               (None, 111, 111, 240)     0
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 55, 55, 240)       2400
_________________________________________________________________
re_lu_4 (ReLU)               (None, 55, 55, 240)       0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 55, 55, 64)        15424
_________________________________________________________________
batch_normalization_2 (Batch (None, 55, 55, 64)        256
_________________________________________________________________
dropout_2 (Dropout)          (None, 55, 55, 64)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 55, 55, 540)       35100
_________________________________________________________________
re_lu_5 (ReLU)               (None, 55, 55, 540)       0
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (None, 27, 27, 540)       5400
_________________________________________________________________
re_lu_6 (ReLU)               (None, 27, 27, 540)       0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 27, 27, 960)       519360
_________________________________________________________________
re_lu_7 (ReLU)               (None, 27, 27, 960)       0
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (None, 13, 13, 960)       9600
_________________________________________________________________
re_lu_8 (ReLU)               (None, 13, 13, 960)       0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 13, 13, 196)       188356
_________________________________________________________________
batch_normalization_4 (Batch (None, 13, 13, 196)       784
_________________________________________________________________
dropout_4 (Dropout)          (None, 13, 13, 196)       0
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 13, 13, 1440)      283680
_________________________________________________________________
re_lu_9 (ReLU)               (None, 13, 13, 1440)      0
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 6, 6, 1440)        14400
_________________________________________________________________
re_lu_10 (ReLU)              (None, 6, 6, 1440)        0
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 6, 6, 360)         518760
_________________________________________________________________
global_max_pooling2d (Global (None, 360)               0
_________________________________________________________________
dense (Dense)                (None, 4)                 1444
=================================================================
Total params: 1,625,460
Trainable params: 1,624,780
Non-trainable params: 680
_________________________________________________________________
